# Цвета темы: "theMe" (упорядоченный хаос)
#		base."0" - Основной фон приложения / терминала
#		base."1" - Альтернативный/темный фон (строка состояния, панели)
#		base."2" - Выделение фона (выбранная строка, курсор)
#		base."3" - Приглушенный текст / комментарии (низкий контраст)
#		base."4" - Второстепенные элементы UI / границы
#		base."5" - Основной текст (Foreground)
#		base."6" - Второстепенный / яркий текст
#		base."7" - Максимально яркий текст / заголовки
#		accent.(bg|fg).(dimmed|normal|bright).<color_name> — 8 акцентных цветов
{
	base = {
		# --- Слой фона (Backgrounds) ---
		"00" = "#060606";
		"01" = "#161616";
		"02" = "#262626";
		"03" = "#464646";
		"04" = "#767676";
		"05" = "#a6a6a6";
		"06" = "#c6c6c6";
		"07" = "#f6f6f6";

		"08" = "#e63636";
		"09" = "#d66616";
		"0A" = "#e6b616";
		"0B" = "#36a646";
		"0C" = "#16a6a6";
		"0D" = "#3666d6";
		"0E" = "#9646c6";
		"0F" = "#c64676";
		"10" = "000000"; # True black
		"11" = "1c1c1c"; # Darkest grey
		"12" = "f64646"; # Bright Red
		"13" = "f6c626"; # Bright Yellow
		"14" = "46c656"; # Bright Green
		"15" = "26b6b6"; # Bright Cyan
		"16" = "4676e6"; # Bright Blue
		"17" = "a656d6"; # Bright Purple
	};
}
