{...}: {
	imports = [
		# ./cosmic-greeter.nix #терпимо,
		# ./dms-greeter.nix #кал 0/10
		# ./gdm.nix # пидоры, №1 по потреблению памяти(в плохом смысле)
		# ./lemurs.nix # ne zarabotal tvar
		# ./ly.nix # работаает зараза
		# ./plasma-login-manager.nix # говно ебаное сука блять белые значки нахуй и белый текст на светлом фоне твари
		# ./sddm.nix # пидоры но работает
		# ./sysc-greet.nix # красиво, но работает уёбищно, трансы-нетакуси, каким-то хуем видит driftwm без пакета сессий, интересно
		./tuigreet.nix # работает, но выглядит уёбищно
	];
}
