# Цвета темы: "theMe" (упорядоченный хаос)
#     base."0" .. base."3" — фон и границы
#     base."4" .. base."a" — элементы UI и приглушенный текст
#     base."b" .. base."f" — основной текст и заголовки
#     accent.(bg|fg).(dimmed|normal|bright).<color_name> — 48 акцентных цветов
{
	base = {
		# --- Слой фона (Background Surface) ---
		"0" = "#060606";
		"1" = "#160606";
		"2" = "#260606";
		"3" = "#360606";
		"4" = "#461616";
		"5" = "#562626";

		# --- Слой UI-элементов и приглушенного текста ---
		"6" = "#665656";
		"7" = "#766666";
		"8" = "#867676";
		"9" = "#968686";
		"a" = "#a69696";
		"b" = "#b6a6a6";

		# --- Текстовый слой (Typography & Content) ---
		"c" = "#c6b6b6"; # Текст статусбара, всплывающие подсказки (tooltips)
		"d" = "#d6c6c6"; # Второстепенный текст, описания
		"e" = "#e6d6d6"; # Основной текст (содержимое файлов, body)
		"f" = "#f6e6e6"; # Заголовки, акцентный текст, активные вкладки
	};

	accent = {
		bg = {
			# --- Акцентные фоны (Background Accents) ---
			dimmed = {
				# --- Приглушенные фоны (мягкая подсветка, тихие плашки) ---
				red = "#660606";
				orange = "#663606";
				yellow = "#666606";
				green = "#066606";
				cyan = "#066666";
				blue = "#063666";
				purple = "#360666";
				magenta = "#660666";
			};
			normal = {
				# --- Фоны (стандартные элементы, бейджи) ---
				red = "#963636";
				orange = "#966636";
				yellow = "#969636";
				green = "#369636";
				cyan = "#369696";
				blue = "#366696";
				purple = "#663696";
				magenta = "#963696";
			};
			bright = {
				# --- Яркие фоны (высокий приоритет, активные выделения) ---
				red = "#c66666";
				orange = "#c69666";
				yellow = "#c6c666";
				green = "#66c666";
				cyan = "#66c6c6";
				blue = "#6696c6";
				purple = "#9666c6";
				magenta = "#c666c6";
			};
		};

		fg = {
			# --- Текст поверх акцентов (Text on Accent) ---
			dimmed = {
				# --- Светлый текст для приглушенных фонов (on bg.dimmed) ---
				red = "#c69696";
				orange = "#c6a696";
				yellow = "#c6c696";
				green = "#96c696";
				cyan = "#96c6c6";
				blue = "#96a6c6";
				purple = "#a696c6";
				magenta = "#c696c6";
			};
			normal = {
				# --- Темный текст для средних фонов (on bg.normal) ---
				red = "#f6c6c6";
				orange = "#f6d6c6";
				yellow = "#f6f6c6";
				green = "#c6f6c6";
				cyan = "#c6f6f6";
				blue = "#c6d6f6";
				purple = "#d6c6f6";
				magenta = "#f6c6f6";
			};
			bright = {
				# --- Контрастный текст для ярких фонов (on bg.bright) ---
				red = "#f6f6f6";
				orange = "#f6f6f6";
				yellow = "#363636";
				green = "#063606";
				cyan = "#063636";
				blue = "#f6f6f6";
				purple = "#f6f6f6";
				magenta = "#f6f6f6";
			};
		};
	};
}
