{
	base = {
		# Фон почти черный с легким красным отливом (R=2, G=0, B=0)
		"00" = "#260606";
		"01" = "#361616"; # Surface
		"02" = "#462626"; # Overlay
		"03" = "#664646"; # Muted
		"04" = "#866666"; # Subtext
		"05" = "#f6c6c6"; # Main Text
		"06" = "#f6d6d6"; # Light Text
		"07" = "#f6e6e6"; # Bright Text

		"08" = "#f60626"; # Red (Ультра-яркий кроваво-алый акцент)
		"09" = "#f65616"; # Orange
		"0A" = "#f6a626"; # Yellow
		"0B" = "#36b656"; # Green
		"0C" = "#16b6a6"; # Cyan
		"0D" = "#2666f6"; # Blue
		"0E" = "#9636f6"; # Purple
		"0F" = "#f61686"; # Magenta
	};
}
