{
	base = {
		"00" = "#160616"; # Темный графит с легким фиолетово-красным подтоном
		"01" = "#360616"; # Акцентные панели (уже выраженный темно-красный)
		"02" = "#561626"; # Бордовый оверлей
		"03" = "#764656"; # Muted
		"04" = "#966676"; # Subtext
		"05" = "#e6d6dc"; # Main Text
		"06" = "#f6e6ec"; # Light Text
		"07" = "#f6f6f6"; # Bright Text

		"08" = "#f61626"; # Red (Алый)
		"09" = "#f66616"; # Orange
		"0A" = "#f6b626"; # Yellow
		"0B" = "#26c656"; # Green
		"0C" = "#16c6a6"; # Cyan
		"0D" = "#3656f6"; # Blue
		"0E" = "#a626f6"; # Purple
		"0F" = "#f61696"; # Magenta
	};
}
