{
	base = {
		# Фон: R=3, G=0, B=1. Маска: #360616.
		# Синий канал 16 гасит рыжину, оставляя благородный темно-бордовый оттенок.
		"00" = "#360616";
		"01" = "#461626"; # Surface / Панели
		"02" = "#562636"; # Overlay / Выделение
		"03" = "#764656"; # Muted / Комментарии
		"04" = "#966676"; # Subtext / Границы
		"05" = "#f6d6e6"; # Текст (мягкий розовато-молочный)
		"06" = "#f6e6f6"; # Яркий текст
		"07" = "#f6f6f6"; # Белый

		"08" = "#f61636"; # Red (Яркий рубин)
		"09" = "#f66626"; # Orange
		"0A" = "#f6c636"; # Yellow
		"0B" = "#26c666"; # Green
		"0C" = "#16c6b6"; # Cyan
		"0D" = "#3666f6"; # Blue
		"0E" = "#a636f6"; # Purple
		"0F" = "#f626a6"; # Magenta
	};
}
