# Цвета темы: "theMe" (упорядоченный хаос)
#		base."0" - Основной фон приложения / терминала
#		base."1" - Альтернативный/темный фон (строка состояния, панели)
#		base."2" - Выделение фона (выбранная строка, курсор)
#		base."3" - Приглушенный текст / комментарии (низкий контраст)
#		base."4" - Второстепенные элементы UI / границы
#		base."5" - Основной текст (Foreground)
#		base."6" - Второстепенный / яркий текст
#		base."7" - Максимально яркий текст / заголовки
#		accent.(bg|fg).(dimmed|normal|bright).<color_name> — 8 акцентных цветов
{
	base = {
		# --- Слой фона (Backgrounds) ---
		"00" = "#360606";
		"01" = "#461616";
		"02" = "#562626";
		"03" = "#665656";
		"04" = "#766666";
		"05" = "#d6c6c6";
		"06" = "#e6d6d6";
		"07" = "#f6e6e6";

		"08" = "#c66666";
		"09" = "#c69666";
		"0A" = "#c6c666";
		"0B" = "#66c666";
		"0C" = "#66c6c6";
		"0D" = "#6696c6";
		"0E" = "#9666c6";
		"0F" = "#c666c6";
	};
	# accent = {
	# 	# --- Акцентные цвета (Accents) ---
	# 	dimmed = {
	# 		# --- Приглушенные цвета ---
	# 		red = "#963636";
	# 		orange = "#966636";
	# 		yellow = "#969636";
	# 		green = "#369636";
	# 		cyan = "#369696";
	# 		blue = "#366696";
	# 		purple = "#663696";
	# 		magenta = "#963696";
	# 	};
	# 	normal = {
	# 		# --- стандартные элементы ---
	# 		red = "#c66666";
	# 		orange = "#c69666";
	# 		yellow = "#c6c666";
	# 		green = "#66c666";
	# 		cyan = "#66c6c6";
	# 		blue = "#6696c6";
	# 		purple = "#9666c6";
	# 		magenta = "#c666c6";
	# 	};
	# 	bright = {
	# 		# --- Яркие цвета (высокий приоритет, активные выделения) ---
	# 		red = "#f69696";
	# 		orange = "#f6c696";
	# 		yellow = "#f6f696";
	# 		green = "#96f696";
	# 		cyan = "#96f6f6";
	# 		blue = "#96c6f6";
	# 		purple = "#c696f6";
	# 		magenta = "#f696f6";
	# 	};
	# };

	# on.accent = {
	# 	# --- Текст поверх акцентов (Text on Accent) ---
	# 	dimmed = {
	# 		# --- Светлый текст для приглушенных цветов (on.accent.dimmed) ---
	# 		red = "#f6c6c6";
	# 		orange = "#f6d6c6";
	# 		yellow = "#f6f6c6";
	# 		green = "#c6f6c6";
	# 		cyan = "#c6f6f6";
	# 		blue = "#c6d6f6";
	# 		purple = "#d6c6f6";
	# 		magenta = "#f6c6f6";
	# 	};
	# 	normal = {
	# 		# --- Темный текст для цветов (on.accent.normal) ---
	# 		red = "#360606";
	# 		orange = "#361606";
	# 		yellow = "#363606";
	# 		green = "#063606";
	# 		cyan = "#063636";
	# 		blue = "#061636";
	# 		purple = "#160636";
	# 		magenta = "#360636";
	# 	};
	# 	bright = {
	# 		# --- Контрастный текст для ярких цветов (on.accent.bright) ---
	# 		red = "#660606";
	# 		orange = "#663606";
	# 		yellow = "#666606";
	# 		green = "#066606";
	# 		cyan = "#066666";
	# 		blue = "#063666";
	# 		purple = "#360666";
	# 		magenta = "#660666";
	# 	};
	# };
}
