# Цвета темы: "theMe" (упорядоченный хаос)
#		base."0" - Основной фон приложения / терминала
#		base."1" - Альтернативный/темный фон (строка состояния, панели)
#		base."2" - Выделение фона (выбранная строка, курсор)
#		base."3" - Приглушенный текст / комментарии (низкий контраст)
#		base."4" - Второстепенные элементы UI / границы
#		base."5" - Основной текст (Foreground)
#		base."6" - Второстепенный / яркий текст
#		base."7" - Максимально яркий текст / заголовки
#		accent.(bg|fg).(dimmed|normal|bright).<color_name> — 8 акцентных цветов
{
	base = {
		# --- Слой фона (Backgrounds) ---
		"00" = "#160606";
		"01" = "#261616";
		"02" = "#562626";
		"03" = "#665656";
		"04" = "#766666";
		"05" = "#d6c6c6";
		"06" = "#e6d6d6";
		"07" = "#f6e6e6";

		"08" = "#c66666";
		"09" = "#c69666";
		"0A" = "#c6c666";
		"0B" = "#66c666";
		"0C" = "#66c6c6";
		"0D" = "#6696c6";
		"0E" = "#9666c6";
		"0F" = "#c666c6";
	};
}
